Repository: DevCraftClub/telegramposting
Catalog: upload/engine/inc/maharder/_locales/*/telegram.xliff
Languages: de_de, uk_ua

source: Отложенный постинг
de_de: Verzögertes Posten
uk_ua: Відкладене публікування

source: -- выбираем, не стесняемся --
de_de: -- nicht scheu sein, auswählen --
uk_ua: -- обираємо, не соромимося --

source: Автор
de_de: Autor

source: Заголовок
de_de: Titel

source: Дата
de_de: Datum

source: Короткое содержание
de_de: Zusammenfassung
uk_ua: Виключити з пошуку по сайту

source: Полное содержание
de_de: Vollständiger Inhalt
uk_ua: Використовувати в Яндекс Турбо

source: Описание
de_de: Beschreibung
uk_ua: Опис

source: ЧПУ Имя
de_de: Slug-Name
uk_ua: ЧПУ Ім'я

source: Кол-во комментариев
de_de: Anzahl der Kommentare
uk_ua: Кількість коментарів

source: Разрешить комментарии
de_de: Kommentare zulassen
uk_ua: Вимкнути

source: Вывод на главной
de_de: Anzeige auf der Startseite
uk_ua: Вивід на головній

source: Проверено
de_de: Überprüft
uk_ua: Перевірено

source: Фиксированная новость
de_de: Fixierte Nachricht
uk_ua: Закріплена новина

source: Разрешить перенос строк
de_de: Zeilenumbrüche erlauben
uk_ua: Дозволити перенос рядків

source: Символ
de_de: Symbol

source: Теги
de_de: Tags

source: Метазаголовок
de_de: Metatitel

source: Кол-во прочтений
de_de: Anzahl der Ansichten
uk_ua: Кількість прочитань

source: Разрешить рейтинг
de_de: Rating zulassen
uk_ua: Дозволити рейтинг

source: Рейтинг
de_de: Bewertung

source: ID Опроса
de_de: Umfrage ID
uk_ua: ID Опитування

source: Кол-во голосов
de_de: Anzahl der Stimmen
uk_ua: Кількість голосів

source: Запретить индексировние
de_de: Indexierung verbieten
uk_ua: Заборонити індексацію

source: Похожие новости
de_de: Ähnliche Nachrichten
uk_ua: Схожі новини

source: Доступ
de_de: Zugang

source: Время редактирования
de_de: Bearbeitungszeit
uk_ua: Час редагування

source: Редактор
de_de: Bearbeiter

source: Причина
de_de: Grund

source: ID автора
de_de: Autor-ID

source: Исключить из поиска
de_de: Von der Site-Suche ausschließen
uk_ua: Виключити з пошуку

source: Нужен пароль
de_de: Passwort erforderlich
uk_ua: Потрібен пароль

source: Разрешить вывод в RSS-ленту
de_de: Ausgabe im RSS-Feed erlauben
uk_ua: Дозволити вивід у RSS-стрічку

source: Разрешить вывод в Турбо-ленту
de_de: Ausgabe im Turbo-Feed erlauben
uk_ua: Дозволити вивід у Турбо-стрічку

source: Разрешить Дзен
de_de: Dzen erlauben
uk_ua: Дозволити Дзен

source: Прочее
de_de: Sonstiges
uk_ua: Інше

source: Название новости
de_de: Nachrichtenüberschrift
uk_ua: Назва новини

source: Тип
de_de: Typ

source: Дата добавления
de_de: Erstelldatum
uk_ua: Дата додавання

source: Действие
de_de: Aktion
uk_ua: Дія

source: Редактировать новость
de_de: Nachricht bearbeiten
uk_ua: Редагувати новину

source: Открыть на сайте
de_de: Auf der Seite öffnen
uk_ua: Відкрити на сайті

source: Изменить дату
de_de: Datum ändern
uk_ua: Змінити дату

source: Отправить в телеграм
de_de: An Telegramm senden
uk_ua: Відправити в телеграм

source: Удалить
de_de: Löschen
uk_ua: Видалити

source: Добавить новость в список
de_de: Nachricht zur Liste hinzufügen
uk_ua: Додати новину до списку

source: Новость
de_de: Nachricht
uk_ua: Новина

source: Время
de_de: Zeit
uk_ua: Час

source: Добавить новость
de_de: Nachricht hinzufügen
uk_ua: Додати новину

source: Изменить:
de_de: Bearbeiten:

source: Удалить:
de_de: Löschen:

source: Отправить в телеграм:
de_de: An Telegramm senden:
uk_ua: Відправити в телеграм:

source: Запись удалена!
de_de: Eintrag wurde gelöscht!
uk_ua: Запис був видалений!

source: Запись успешно сохранена!
de_de: Eintrag erfolgreich gespeichert!
uk_ua: Запис успішно збережено!

source: Запись успешно создана!
de_de: Eintrag erfolgreich erstellt!
uk_ua: Запис успішно створено!

source: Массив изображений либо сменил структуру, либо не верен.
de_de: Das Bildarray hat entweder die Struktur geändert oder ist nicht korrekt.
uk_ua: Масив зображень або змінив структуру, або невірний.

source: Изображения пусты
de_de: Bilder sind leer
uk_ua: Зображення порожні

source: Новость не соответствует требованиям!
de_de: Nachricht entspricht nicht den Anforderungen!
uk_ua: Новина не відповідає вимогам!

source: Файл изображения либо повреждён, либо полностью отсутствует
de_de: Die Bilddatei ist entweder beschädigt oder vollständig nicht vorhanden
uk_ua: Файл зображення або пошкоджений, або повністю відсутній

source: Файл изображения весит больше допустимого
de_de: Die Bilddatei ist größer als erlaubt
uk_ua: Файл зображення важить більше дозволеного

source: Размеры изображения больше допустимого!
de_de: Die Bildabmessungen sind größer als erlaubt!
uk_ua: Розміри зображення більші дозволених!

source: Файл не найден
de_de: Datei nicht gefunden
uk_ua: Файл не знайдено

source: Формат файла (:type) не подерживается
de_de: Dateiformat (:type) wird nicht unterstützt
uk_ua: Формат файлу (:type) не підтримується

source: Не указан размер изображения
de_de: Bildgröße nicht angegeben
uk_ua: Не вказано розмір зображення

source: Файл маски не найден
de_de: Maskendatei nicht gefunden
uk_ua: Файл маски не знайдено

source: Формат файла (:format) маски не поддерживается
de_de: Dateiformat (:format) der Maske wird nicht unterstützt
uk_ua: Формат файлу (:format) маски не підтримується

source: [UPDATE] Изменена функция обработки текстов: удаляются все теги из краткой и полной новости
de_de: [UPDATE] Die Textverarbeitungsfunktion geändert: alle Tags aus der kurzen und vollständigen Nachricht werden entfernt
uk_ua: [UPDATE] Змінено функцію обробки текстів: видаляються всі теги з короткої та повної новини

source: [FIX] Исправлены все заявленные ошибки
de_de: [FIX] Alle gemeldeten Fehler behoben
uk_ua: [FIX] Виправлено всі заявлені помилки

source: <span class="ui red text">[INFO] Последняя версия данного плагина!</span>
de_de: <span class="ui red text">[INFO] Die neueste Version dieses Plugins!</span>
uk_ua: <span class="ui red text">[INFO] Остання версія цього плагіна!</span>

source: [UPDATE] Обновлено до DLE 17.3 и MHAdmin 173.3.4
de_de: [UPDATE] Code auf Version MHAdmin 2.0.7 aktualisiert
uk_ua: [UPDATE] Оновлено до DLE 17.3 та MHAdmin 173.3.4

source: [FIX] Исправлена заявленная ошибка: https://skripters.biz/forum/threads/telegram-posting.50716/#post-497819
de_de: [FIX] Fehler behoben: https://skripters.biz/forum/threads/telegram-posting.50716/#post-497819
uk_ua: [FIX] Виправлена заявлена помилка: https://skripters.biz/forum/threads/telegram-posting.50716/#post-497819

source: [FIX] Исправлена заявленная ошибка: Конвертер изображений неверно обрабатывал пути до временных файлов
de_de: [FIX] Fehler behoben: Der Bildkonverter hat die Pfade zu temporären Dateien falsch verarbeitet
uk_ua: [FIX] Виправлена заявлена помилка: Конвертер зображень неправильно обробляв шляхи до тимчасових файлів

source: [FIX] Исправлен установщик
de_de: [FIX] Installations-Skript korrigiert
uk_ua: [FIX] Виправлено інсталятор

source: [FIX] Исправлены ошибки подключений
de_de: [FIX] Verbindungsfehler behoben
uk_ua: [FIX] Виправлено помилки підключень

source: [FIX] Исправлен скрипт очистки временных файлов
de_de: [FIX] Skript zur Bereinigung temporärer Dateien korrigiert
uk_ua: [FIX] Виправлено скрипт очищення тимчасових файлів

source: [FIX] Исправлено под MH Admin 2.0.8
de_de: [UPDATE] Code auf Version MHAdmin 2.0.7 aktualisiert
uk_ua: [FIX] Виправлено сумісність з версією MH Admin 2.0.8

source: [FIX] Удалён мусор
de_de: [FIX] Müll entfernt
uk_ua: [FIX] Видалено сміття

source: [UPDATE] Обновление кода до версии MHAdmin 2.0.7
de_de: [UPDATE] Code auf Version MHAdmin 2.0.7 aktualisiert
uk_ua: [UPDATE] Оновлення коду до версії MHAdmin 2.0.7

source: [NEW] Добавлена возможность назначать отдельно разделители тегов, хештегов и категорий
de_de: [NEW] Möglichkeit hinzugefügt, Tag-Trennzeichen, Hashtags und Kategorien separat zuzuweisen
uk_ua: [NEW] Додано можливість призначати окремо роздільники тегів, хештегів та категорій

source: [FIX] Исправлена совместимость с версией PHP 7.2
de_de: [FIX] Kompatibilität mit PHP Version 7.2 behoben
uk_ua: [FIX] Виправлена сумісність з версією PHP 7.2

source: [FIX] Исправлена совместимость с версией DLE до 1.5.0
de_de: [FIX] Kompatibilität mit DLE-Version bis 1.5.0 behoben
uk_ua: [FIX] Виправлена сумісність з версією DLE до 1.5.0

source: [FIX] Исправлена заявленная ошибка: https://devcraft.club/tickets/prevju.5/
de_de: [FIX] Fehler behoben: https://devcraft.club/tickets/prevju.5/
uk_ua: [FIX] Виправлена заявлена помилка: https://devcraft.club/tickets/prevju.5/

source: [FIX] Исправлена заявленная ошибка: https://devcraft.club/tickets/jazykovoj-kod-ru_ru-ne-najden-i-mysql-error.4/
de_de: [FIX] Fehler behoben: https://devcraft.club/tickets/jazykovoj-kod-ru_ru-ne-najden-i-mysql-error.4/
uk_ua: [FIX] Виправлена заявлена помилка: https://devcraft.club/tickets/jazykovoj-kod-ru_ru-ne-najden-i-mysql-error.4/

source: [FIX] Исправлена заявленная ошибка: обработка данных тега [telegram_media_
de_de: [FIX] Verarbeitung der Daten des Tags [telegram_media_
uk_ua: [FIX] Виправлена заявлена помилка: обробка даних тегу [telegram_media_

source: [FIX] Тег {category} исправлен
de_de: [FIX] Tag {category} behoben
uk_ua: [FIX] Тег {category} виправлено

source: [FIX] Тег {link-category} исправлен
de_de: [FIX] Tag {link-category} behoben
uk_ua: [FIX] Тег {link-category} виправлено

source: [FIX] Поправлен вывод категорий в виде хештегов
de_de: [FIX] Ausgabe der Kategorien als Hashtags behoben
uk_ua: [FIX] Виправлено виведення категорій у вигляді хештегів

source: [NEW] Добавлен тег {category-hashtag} - отвечающий за вывод категории новости в виде хештегов.
de_de: [NEW] Tag {category-hashtag} hinzugefügt - verantwortlich für die Anzeige der Nachrichtenkategorie als Hashtags.
uk_ua: [NEW] Додано тег {category-hashtag} - відповідає за виведення категорії новини у вигляді хештегів.

source: [NEW] Добавлен тег {link-category} - отвечающий за вывод категории новости в виде ссылок на вашем сайте.
de_de: [NEW] Tag {link-category} hinzugefügt - verantwortlich für die Anzeige der Nachrichtenkategorie als Links auf Ihrer Website.
uk_ua: [NEW] Додано тег {link-category} - відповідає за виведення категорії новини у вигляді посилань на вашому сайті.

source: [NEW] Добавлен тег {category} - отвечающий за вывод категории новости в виде текста.
de_de: [NEW] Tag {category} hinzugefügt - verantwortlich für die Anzeige der Nachrichtenkategorie als Text.
uk_ua: [NEW] Додано тег {category} - відповідає за виведення категорії новини у вигляді тексту.

source: [NEW] Добавлен тег {views} - отвечающий за кол-во просмотров новости.
de_de: [NEW] Tag {views} hinzugefügt - verantwortlich für die Anzahl der Nachrichtenansichten.
uk_ua: [NEW] Додано тег {views} - відповідає за кількість переглядів новини.

source: [NEW] Добавлен тег {comments-num} - отвечающий за кол-во комментариев в новости.
de_de: [NEW] Tag {comments-num} hinzugefügt - verantwortlich für die Anzahl der Kommentare zur Nachricht.
uk_ua: [NEW] Додано тег {comments-num} - відповідає за кількість коментарів у новині.

source: [NEW] Добавлен тег {now=FORMAT} - отвечающий за текущее время в пользовательском формате.
de_de: [NEW] Tag {now=FORMAT} hinzugefügt - verantwortlich für die aktuelle Zeit im benutzerdefinierten Format.
uk_ua: [NEW] Додано тег {now=FORMAT} - відповідає за поточний час у користувацькому форматі.

source: [NEW] Добавлен тег {now} - отвечающий за текущее время.
de_de: [NEW] Tag {now} hinzugefügt - verantwortlich für die aktuelle Zeit.
uk_ua: [NEW] Додано тег {now} - відповідає за поточний час.

source: [NEW] Добавлена функция проверки изображения на требуемые свойства для отправки
de_de: [NEW] Funktion zur Überprüfung der für das Senden erforderlichen Bildeigenschaften hinzugefügt
uk_ua: [NEW] Додано функцію перевірки зображення на необхідні властивості для відправки

source: [UPDATE] Поправлена функция конвертации WebP в JPG, если данная опция отключена в настройках DLE.
de_de: [UPDATE] Funktion zur Konvertierung von WebP in JPG verbessert, falls diese Option in den DLE-Einstellungen deaktiviert ist.
uk_ua: [UPDATE] Виправлено функцію конвертації WebP у JPG, якщо ця опція вимкнена в налаштуваннях DLE.

source: [FIX] Исправлена заявленная ошибка на сайте: https://devcraft.club/tickets/modul-telegram-posting-rabotaet-s-oshibkami.2/
de_de: [FIX] Gemeldeter Fehler auf der Website behoben: https://devcraft.club/tickets/modul-telegram-posting-rabotaet-s-oshibkami.2/
uk_ua: [FIX] Виправлена заявлена помилка на сайті: https://devcraft.club/tickets/modul-telegram-posting-rabotaet-s-oshibkami.2/

source: [FIX] Исправлена ошибка отправки лишь одного шаблона в телеграм
de_de: [FIX] Fehler behoben, dass nur eine Vorlage an Telegram gesendet wurde
uk_ua: [FIX] Виправлено відправку лише одного шаблону в телеграм

source: [FIX] Исправлен файл установки (install.xml), при обновлении выдавало ошибку, что значение TABLE лишнее
de_de: [FIX] Installationsdatei (install.xml) korrigiert, während des Updates wurde ein Fehler angezeigt, dass der TABLE-Wert überflüssig war
uk_ua: [FIX] Виправлено файл установки (install.xml), при оновленні видавав помилку, що значення TABLE зайве

source: [NEW] К редактору шаблонов была добавлена возможность копирования из других шаблонов
de_de: [NEW] Möglichkeit zum Kopieren aus anderen Vorlagen zum Vorlageneditor hinzugefügt
uk_ua: [NEW] До редактора шаблонів додано можливість копіювання з інших шаблонів

source: [NEW] К редактору шаблонов была добавлена возможность поиска и вставки возможных тегов с их описанием (макс. 800 символов)
de_de: [NEW] Möglichkeit zur Suche und Einfügung möglicher Tags mit deren Beschreibung zum Vorlageneditor hinzugefügt (max. 800 Zeichen)
uk_ua: [NEW] До редактора шаблонів додано можливість пошуку та вставки можливих тегів з їх описом (макс. 800 символів)

source: [UPDATE] Редактор сообщений был упрощён
de_de: [UPDATE] Nachrichteneditor wurde vereinfacht
uk_ua: [UPDATE] Редактор повідомлень було спрощено

source: [FIX] Исправлен парсинг содержимого, переставил местами обработчики
de_de: [FIX] Inhalt Parsing korrigiert, die Handler wurden vertauscht
uk_ua: [FIX] Виправлено розбір змісту, переставив місцями обробники

source: [NEW]: Добавлена конвертация WebP в JPG/PNG
de_de: [NEW]: Konvertierung von WebP zu JPG/PNG hinzugefügt
uk_ua: [NEW]: Додано конвертацію WebP у JPG/PNG

source: [NEW]: Добавлена настройка задержки отправки новостей в телеграм при работе с кроном
de_de: [NEW]: Einstellung zur Verzögerung des Sendens von Nachrichten an Telegram beim Einsatz von Cron hinzugefügt
uk_ua: [NEW]: Додано налаштування затримки відправки новин у телеграм при роботі з кроном

source: [NEW]: Добавлена настройка удаления неверно добавленных новостей в отложенные сообщения
de_de: [NEW]: Einstellung zum Löschen fälschlicherweise hinzugefügter Nachrichten in verzögerten Nachrichten hinzugefügt
uk_ua: [NEW]: Додано налаштування видалення неправильно доданих новин у відкладені повідомлення

source: [UPDATE] Плагин обновлён до последней версии MHAdmin (2.0.5)
de_de: [UPDATE] Plugin auf die neueste Version von MHAdmin (2.0.5) aktualisiert
uk_ua: [UPDATE] Плагін оновлено до останньої версії MHAdmin (2.0.5)

source: [FIX] Устранена зависимость от класса миниатюр самой DLE, плагин будет работать на DLE 15.1
de_de: [FIX] Abhängigkeit von der Thumbnail-Klasse von DLE entfernt, das Plugin funktioniert jetzt mit DLE 15.1
uk_ua: [FIX] Усунута залежність від класу мініатюр самої DLE, плагін буде працювати на DLE 15.1

source: [FIX] Устранена ошибка проверки зависимости при добавлении/редактировании новости
de_de: [FIX] Abhängigkeitsprüfungsfehler beim Hinzufügen/Bearbeiten von Nachrichten behoben
uk_ua: [FIX] Усунута помилка відправки новини по крону, функціонал перебудовано

source: [FIX] Устранена ошибка отправки новости по крону, функционал переработан
de_de: [FIX] Fehler beim Senden von Nachrichten über Cron behoben, Funktionalität überarbeitet
uk_ua: [FIX] Усунута помилка перевірки залежності при додаванні/редагуванні новини

source: FIX: Теперь можно указывать прочие зависимости (забыл добавить их в массив)
de_de: FIX: Jetzt können weitere Abhängigkeiten angegeben werden (hatte vergessen, sie dem Array hinzuzufügen)
uk_ua: FIX: Тепер можна вказувати інші залежності (забув додати їх у масив)

source: FIX: Обработка текста перенесена уже в новую функцию, поскольку урезались нужные теги для обработки данных
de_de: FIX: Textverarbeitung wurde bereits in eine neue Funktion verlegt, da die erforderlichen Tags für die Datenverarbeitung reduziert wurden
uk_ua: FIX: Обробка тексту перенесена вже у нову функцію, оскільки скорочено необхідні теги для обробки даних

source: FIX: Поправлен тег [xfvalue_XXX_hashtag]
de_de: FIX: Tag [xfvalue_XXX_hashtag] korrigiert
uk_ua: FIX: Поправлено тег [xfvalue_XXX_hashtag]

source: FIX: Исправлена работа с кроном. Временный штамп не отправлялся в базу данных
de_de: FIX: Arbeit mit Cron verbessert. Der temporäre Zeitstempel wurde nicht an die Datenbank gesendet
uk_ua: FIX: Виправлено роботу з кроном. Тимчасовий штамп не відправлявся до бази даних

source: NEW: Добавлен вывод списка с ожидаемыми новостями на отправку
de_de: [NEW]: Ausgabe einer Liste mit ausstehenden Nachrichten zum Senden hinzugefügt
uk_ua: NEW: Додано вивід списку з очікуючими новинами на відправку

source: Логирование не работает на PHP 7.4, поэтому для таких случаев сделан вывод в браузер
de_de: Die Protokollierung funktioniert in PHP 7.4 nicht, daher erfolgt in solchen Fällen die Ausgabe im Browser
uk_ua: Логування не працює на PHP 7.4, тому для таких випадків зроблено вивід у браузер

source: FIX: Убраны дубли
de_de: FIX: Duplikate entfernt
uk_ua: FIX: Видалено дублікати

source: FIX: Исправлена "копипаста
de_de: FIX: "Copy-Paste" behoben
uk_ua: FIX: Виправлено "копіпаста"

source: FIX: Для файлов в доп. полях которые сохраняются как [attachment...] была сделана обработка (упустил из виду)
de_de: FIX: Für Dateien in zusätzlichen Feldern, die als [attachment...] gespeichert werden, wurde eine Verarbeitung durchgeführt (übersehen)
uk_ua: FIX: Для файлів у додаткових полях, які зберігаються як [attachment...] було зроблено обробку (пропустив з виду)

source: NEW: Максимальная длина сообщения отправляемого в телеграм была установлена, вшита в код. Это - 1024 символов, включая пробелы. Если длина сообщения равна или больше 1024 символов, то отправляются 1021 символа и троеточие в конце.
de_de: [NEW] Die maximale Länge der an Telegram gesendeten Nachricht wurde festgelegt und im Code eingebettet. Sie beträgt 1024 Zeichen, einschließlich Leerzeichen. Wenn die Nachrichtenlänge gleich oder größer als 1024 Zeichen ist, werden 1021 Zeichen und ein Auslassungszeichen am Ende gesendet.
uk_ua: NEW: Максимальна довжина повідомлення, відправленого в телеграм, була встановлена, вбудована у код. Це - 1024 символів, включаючи пробіли. Якщо довжина повідомлення дорівнює або більше 1024 символів, то відправляються 1021 символ і три крапки в кінці.

source: FIX: Сбор изображений из базы данных был исправлен
de_de: FIX: Sammlung von Bildern aus der Datenbank wurde behoben
uk_ua: FIX: Збір зображень з бази даних було виправлено

source: FIX: Миниатюры теперь генерируются из списка всех изображений
de_de: FIX: Vorschaubilder werden nun aus der Liste aller Bilder generiert
uk_ua: FIX: Мініатюри тепер генеруються зі списку всіх зображень

source: FIX: Исправлена отправка данные, если указана внутренняя ссылка без домена, а-ля /uploads/...
de_de: FIX: Datenübertragung behoben, wenn ein interner Link ohne Domain angegeben ist, zum Beispiel /uploads/...
uk_ua: FIX: Виправлено відправку даних, якщо вказане внутрішнє посилання без домену, а-ля /uploads/...

source: Добавлено кеширование данных на запросы в базу данных
de_de: Data-Caching für Datenbankanfragen hinzugefügt
uk_ua: Додано кешування даних на запити до бази даних

source: В общий массив медиа добавлены изображения и файлы из базы данных, если такие есть.
de_de: Bilder und Dateien aus der Datenbank werden dem allgemeinen Medienarray hinzugefügt, sofern vorhanden.
uk_ua: До загального масиву медіа додані зображення та файли з бази даних, якщо такі є.

source: FIX: Исправлен запрос в базу данных на новость (забыл закрывающую скобку поставить)
de_de: FIX: Datenbankabfrage für Nachrichten korrigiert (hatte vergessen, eine schließende Klammer zu setzen)
uk_ua: FIX: Виправлено запит до бази даних на новину (забув закрити дужку)

source: Что-бы включить логирование отправки данных, достаточно в файле RePost.php заменить $logs = 0 на $logs = 1
de_de: Um das Logging der Datenübertragung zu aktivieren, ersetzen Sie einfach $logs = 0 durch $logs = 1 in der Datei RePost.php
uk_ua: Щоб ввімкнути логування відправки даних, достатньо у файлі RePost.php замінити $logs = 0 на $logs = 1

source: FIX: Добавление аудио из доп. полей в общий массив
de_de: FIX: Audio aus zusätzlichen Feldern zum allgemeinen Array hinzugefügt
uk_ua: FIX: Додавання аудіо з додаткових полів до загального масиву

source: FIX: Добавление видео из доп. полей в общий массив
de_de: FIX: Video aus zusätzlichen Feldern zum allgemeinen Array hinzugefügt
uk_ua: FIX: Додавання відео з додаткових полів до загального масиву

source: Добавлена заглушка по умолчанию из сервиса dummyimage.com
de_de: Standardplatzhalter vom Dienst dummyimage.com hinzugefügt
uk_ua: Додано заглушку за замовчуванням з сервісу dummyimage.com

source: FIX: Исправлена отправка файлов со сторонних источников
de_de: FIX: Senden von Dateien aus externen Quellen behoben
uk_ua: FIX: Виправлено відправку файлів зі сторонніх джерел

source: FIX: Исправлена отправка текстовых сообщений
de_de: FIX: Sendung von Textnachrichten behoben
uk_ua: FIX: Виправлено відправку текстових повідомлень

source: FIX: Отправка сообщений из настроек
de_de: FIX: Senden von Nachrichten aus den Einstellungen behoben
uk_ua: FIX: Відправка повідомлень з налаштувань

source: FIX: Сохранение зависимостей (скрипт начинал работать после подключения второй зависимости, из-за чего вызывал ошибку 504)
de_de: FIX: Abhängigkeiten speichern (Skript begann nach dem Anschließen der zweiten Abhängigkeit zu arbeiten, was Fehler 504 verursachte)
uk_ua: FIX: Збереження залежностей (скрипт починав працювати після підключення другої залежності, через що викликав помилку 504)

source: FIX: Если файл указан как ссылка (простое текстовое поле), то он пропускался. Теперь, если файл находится не на сервере, то пропускает проверку, а указывается как ссылка.
de_de: FIX: Wenn die Datei als Link angegeben ist (einfaches Textfeld), wurde sie übersprungen. Jetzt, wenn die Datei nicht auf dem Server ist, wird die Überprüfung übersprungen und als Link angegeben.
uk_ua: FIX: Якщо файл вказаний як посилання (просте текстове поле), то він пропускався. Тепер, якщо файл знаходиться не на сервері, то пропускає перевірку, а вказується як посилання.

source: FIX: Убраны дубли, из-за чего движок ругался
de_de: FIX: Duplikate entfernt, was dazu führte, dass die Engine sich beschwerte
uk_ua: FIX: Видалено дублікати, через що движок скаржився

source: Фикс файла version.php. При мёрдже файл был сохранён не верно
de_de: FIX für die Datei version.php. Beim Mergen wurde die Datei falsch gespeichert
uk_ua: Виправлено файл version.php. При мёрджі файл було збережено неправильно

source: Добавлена поддержка медиа контента. Можно выбирать одно из двух.
de_de: Unterstützung für Medieninhalte hinzugefügt. Sie können eines von zwei auswählen.
uk_ua: Додано підтримку медіаконтенту. Можна обирати одне з двох.

source: Добавлена поддержка парсинга всех стандртных тегов DLE
de_de: Unterstützung für das Parsen aller Standard-DLE-Tags hinzugefügt
uk_ua: Додано підтримку парсингу всіх стандартних тегів DLE

source: Исправлена проблема с отрпавкой данных из HTML редактора
de_de: Problem mit dem Senden von Daten aus dem HTML-Editor behoben
uk_ua: Виправлено проблему з відправкою даних з HTML редактора
