Repository: DevCraftClub/telegramposting
Catalog: upload/engine/inc/maharder/_locales/*/telegram.xliff
Languages: de_de, uk_ua

source: Небольшой фикс касательно поиска названия группы / канала
de_de: Kleiner Fix bezüglich der Suche nach dem Namen der Gruppe / des Kanals
uk_ua: Невеликий фікс щодо пошуку назви групи / каналу

source: Созданы значения по умолчанию для крона, теперь, даже если он и не настроен, телеграм будет получать сообщения по крону
de_de: Standardwerte für Cron erstellt, jetzt erhält Telegram auch dann Cron-Nachrichten, wenn es nicht konfiguriert ist
uk_ua: Створено значення за замовчуванням для крону, тепер, навіть якщо він і не налаштований, телеграм буде отримувати повідомлення по крону

source: Обновлено для версии DLE 14.x
de_de: Für DLE-Version 14.x aktualisiert
uk_ua: Оновлено для версії DLE 14.x

source: Добавлена возможность выводить лимитированные описания
de_de: Die Möglichkeit hinzugefügt, begrenzte Beschreibungen anzuzeigen
uk_ua: Додано можливість виводити обмежені описи

source: Исправлен поиск чата
de_de: Chat-Suche korrigiert
uk_ua: Виправлено пошук чату

source: Исправлены мелкие баги и недочёты
de_de: Kleine Bugs und Mängel behoben
uk_ua: Виправлено дрібні баги та недоліки

source: Добавлена поддержка SOCKS5 прокси.
de_de: Unterstützung für SOCKS5-Proxy hinzugefügt.
uk_ua: Додано підтримку SOCKS5 проксі.

source: Небольшой фикс со стилями.
de_de: Kleiner Fix mit den Stilen.
uk_ua: Невеликий фікс зі стилями.

source: Небольшой фикс по отправке сообщений.
de_de: Kleiner Fix beim Senden von Nachrichten.
uk_ua: Невеликий фікс по відправці повідомлень.

source: Исправлена ошибка созданная гитом
de_de: Fehler behoben, der durch Git verursacht wurde
uk_ua: Виправлено помилку, створену гітом

source: Добавлена возможность отправлять в телеграм при добавлении с сайта
de_de: Die Möglichkeit hinzugefügt, beim Hinzufügen von der Website an Telegram zu senden
uk_ua: Додано можливість відправляти в телеграм при додаванні з сайту

source: Добавлены новые теги для шаблонов: %categories% (выводит все категории через разделитель указанный в настройках движка) и %category_links% (выводит так же категории, только ссылками)
de_de: Neue Template-Tags hinzugefügt: %categories% (zeigt alle Kategorien mit dem im Engine-Setup angegebenen Trennzeichen an) und %category_links% (zeigt die Kategorien ebenfalls als Links an)
uk_ua: Додано нові теги для шаблонів: %categories% (виводить всі категорії через роздільник, вказаний у налаштуваннях движка) та %category_links% (виводить також категорії, тільки посиланнями)

source: Добавлены новые теги для шаблонов: [xfgiven_XXX]XYZ[/xfgiven_XXX] (аналогичен тегам для новостей, если доп. поле заполнено, то выведет информацию заключённую в теги)
de_de: Neue Template-Tags hinzugefügt: [xfgiven_XXX]XYZ[/xfgiven_XXX] (ähnlich zu Tags für Nachrichten, wenn das zusätzliche Feld ausgefüllt ist, wird die im Tag eingeschlossene Information angezeigt)
uk_ua: Додано нові теги для шаблонів: [xfgiven_XXX]XYZ[/xfgiven_XXX] (аналогічні тегам для новин, якщо додаткове поле заповнене, то виведе інформацію, закорочену в теги)

source: Добавлены новые теги для шаблонов: [xfnotgiven_XXX]XYZ[/xfnotgiven_XXX] (аналогичен тегам для новостей, если доп. поле не заполнено, то выведет информацию заключённую в теги)
de_de: Neue Template-Tags hinzugefügt: [xfnotgiven_XXX]XYZ[/xfnotgiven_XXX] (ähnlich zu Tags für Nachrichten, wenn das zusätzliche Feld nicht ausgefüllt ist, wird die im Tag eingeschlossene Information angezeigt)
uk_ua: Додано нові теги для шаблонів: [xfnotgiven_XXX]XYZ[/xfnotgiven_XXX] (аналогічні тегам для новин, якщо додаткове поле не заповнене, то виведе інформацію, закорочену в теги)

source: Исправлено пару багов
de_de: Ein paar Fehler behoben
uk_ua: Виправлено пару багів

source: Облегчённая версия
de_de: Leichtgewichtige Version
uk_ua: Полегшена версія

source: Версия для DLE 13 и выше
de_de: Version für DLE 13 und höher
uk_ua: Версія для DLE 13 та вище

source: Мелкие правки
de_de: Kleinere Änderungen
uk_ua: Мелкі виправлення

source: Добавлена возможность использовать прокси (актуально для сайтов размещённых в РФ)
de_de: Möglichkeit zur Nutzung von Proxys hinzugefügt (relevant für in Russland gehostete Websites)
uk_ua: Додано можливість використовувати проксі (актуально для сайтів розміщених в РФ)

source: Добавлена возможность отправки сообщений по крону
de_de: Möglichkeit zum Senden von Nachrichten per Cron hinzugefügt
uk_ua: Додано можливість відправки повідомлень по крону

source: Последняя версия для DLE 12.x (Добавлена конвертация текстав нужную кодировку)
de_de: Neueste Version für DLE 12.x (Textkonvertierung in die benötigte Codierung hinzugefügt)
uk_ua: Остання версія для DLE 12.x (Додано конвертацію текстів у потрібну кодування)

source: Исправлена ошибка со считыванием данных
de_de: Fehler beim Lesen von Daten behoben
uk_ua: Виправлено помилку зі зчитуванням даних

source: Добавлены новые теги для шаблонов: %full_descr% и %short_descr%
de_de: Neue Template-Tags hinzugefügt: %full_descr% und %short_descr%
uk_ua: Додано нові теги для шаблонів: %full_descr% та %short_descr%

source: Тег %descr% будет заменён на %short_descr%
de_de: Tag %descr% wird durch %short_descr% ersetzt
uk_ua: Тег %descr% буде замінено на %short_descr%

source: Исправлена ошибка с доп. полями
de_de: Fehler bei zusätzlichen Feldern behoben
uk_ua: Виправлено помилку з додатковими полями

source: Базовая версия
de_de: Grundversion
uk_ua: Базова версія

source: Отправка сообщений при добавлении новости
de_de: Senden von Nachrichten beim Hinzufügen von Nachrichten
uk_ua: Відправка повідомлень при додаванні новини

source: Отправка сообщений при редактировании новости
de_de: Senden von Nachrichten beim Bearbeiten von Nachrichten
uk_ua: Відправка повідомлень при редагуванні новини

source: Отправка при зависимости от полей
de_de: Senden abhängig von Feldern
uk_ua: Відправка при залежності від полів

source: Отправка обычного сообщения на канал
de_de: Nachrichten an Telegram-Kanal oder Gruppe senden
uk_ua: Відправка звичайного повідомлення на канал

source: Поиск нужного чата
de_de: Suche nach dem benötigten Chat
uk_ua: Пошук потрібного чату

source: Настройка шаблонов для отправки сообщений
de_de: Einrichten von Vorlagen zum Senden von Nachrichten
uk_ua: Налаштування шаблонів для відправки повідомлень

source: Если сайт работает через SSL, то будет возможность приобразовать бота в Webhook
de_de: Wenn die Website über SSL läuft, besteht die Möglichkeit, den Bot in einen Webhook umzuwandeln
uk_ua: Якщо сайт працює через SSL, то буде можливість перетворити бота у Webhook

source: Журнал изменений
de_de: Änderungsprotokoll
uk_ua: Журнал змін

source: Список отложенной отправки
de_de: Liste der verzögerten Sendungen
uk_ua: Список відкладеної відправки

source: ID Новости
de_de: Nachrichten-ID
uk_ua: ID Новини

source: Запланированная отправка
de_de: Geplante Sendung
uk_ua: Запланована відправка

source: Страница %page%
de_de: Seite %page%
uk_ua: Сторінка %page%

source: Разрешеить комментарии
de_de: Kommentare erlauben
uk_ua: Дозволити коментарі

source: Настройки модуля
de_de: Modul-Einstellungen
uk_ua: Налаштування модуля

source: ID новости
de_de: Nachrichten-ID
uk_ua: ID новини

source: Запланированная дата
de_de: Geplantes Datum
uk_ua: Запланована дата

source: Как новую новость
de_de: Als neue Nachricht
uk_ua: Як нову новину

source: Как отредактированную новость
de_de: Als bearbeitete Nachricht
uk_ua: Як відредаговану новину

source: Ошибка при парсинге новостей! Подробности в консоли!
de_de: Fehler beim Parsen der Nachrichten! Details in der Konsole!
uk_ua: Сталася помилка при обробці новин! Подробиці в консолі!

source: Сохранить
de_de: Speichern
uk_ua: Зберегти

source: Отмена
de_de: Abbrechen
uk_ua: Скасувати

source: Изменить:
de_de: Bearbeiten:

source: Отправление было успешно изменено!
de_de: Senden wurde erfolgreich geändert!
uk_ua: Відправлення було успішно змінено!

source: Удалить:
de_de: Löschen:
uk_ua: Видалити:

source: После удаления, данные будет не возможно вернуть!
de_de: Nach der Löschung können die Daten nicht wiederhergestellt werden!
uk_ua: Після видалення, дані буде неможливо повернути!

source: Отправить в телеграм:
de_de: An Telegram senden:
uk_ua: Відправити в телеграм:

source: Подтвердите отправку новости в телеграм! После успешного отправления, новость удалится из списка ожидания на отправку!
de_de: Bestätigen Sie das Senden der Nachricht an Telegram! Nach erfolgreichem Senden wird die Nachricht aus der Warteschlange zum Senden entfernt!
uk_ua: Підтвердіть відправку новини в телеграм! Після успішного відправлення, новина видалиться зі списку очікування на відправку!

source: Отправить
de_de: Senden
uk_ua: Відправити

source: Произошла ошибка при обработке данных! Смотрите консоль браузера для подробностей!
de_de: Beim Verarbeiten der Daten ist ein Fehler aufgetreten! Siehe die Browser-Konsole für Details!
uk_ua: Сталася помилка при обробці даних! Дивіться консоль браузера для подробиць!

source: Новость была успешно отправлена в телеграм!
de_de: Nachricht wurde erfolgreich an Telegram gesendet!
uk_ua: Новина була успішно відправлена в телеграм!

source: Новость не могла быть обработана!<br><b>Причина</b>:
de_de: Nachricht konnte nicht verarbeitet werden!<br><b>Grund</b>:
uk_ua: Новина не могла бути оброблена!<br><b>Причина</b>:

source: Отправка сообщений в телеграм канал или группу
de_de: Nachrichten an Telegram-Kanal oder Gruppe senden
uk_ua: Відправка повідомлень в телеграм канал або групу
